<?php

namespace LaraStore\Forms\Card;

use App\Models\Card;
use Auth;
use LaraStore\Forms\Form;
use App\Http\Controllers\Api\ApiController as Api;

class CheckForm extends Form{

	protected $api;
	/*
    |-------------------------------------------------------------------------------
    |
    | 注册表单验证规则
    |
    |-------------------------------------------------------------------------------
    */
    protected $rules = [
        
        'card_sn'  =>'required',
    ];


    /*
    |-------------------------------------------------------------------------------
    |
    | 注册表单验证规则提示信息
    |
    |-------------------------------------------------------------------------------
    */
    protected $messages = [

       	'card_sn.required' =>'礼品卡号必须填写',
       
    ];


    /*
    |-------------------------------------------------------------------------------
    |
    | 构造函数
    |
    |-------------------------------------------------------------------------------
    */
    public function __construct(Api $api){
       $this->api       = $api;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 是否登录
    |
    |-------------------------------------------------------------------------------
    */
    public function auth(){

        return  (Auth::check('user'))? true :false;
    }



    /*
    |-------------------------------------------------------------------------------
    |
    | 当前登录用户
    |
    |-------------------------------------------------------------------------------
    */
    public function user(){

        return Auth::user('user');
    }



    /*
    |-------------------------------------------------------------------------------
    |
    |  检测礼品卡是否有效
    |
    |-------------------------------------------------------------------------------
    */
    public function giftCheck(){

        $user       = Auth::user('user');

        return ($user->checkGiftCard($this->card_sn))? true:false;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  礼品卡总金额大于购物车中所有商品的金额
    |
    |-------------------------------------------------------------------------------
    */
    public function isAllCardPay(){

        //当前用户购物车中被选中的商品总金额
        $user               = $this->user();
        $cartAmount         = $user->amount();

        //礼品卡总金额
        $card               = $this->card();
        $cardAmount         = $card->price;

        return ($cartAmount > $cardAmount )? false : true;

    }



    /*
    |-------------------------------------------------------------------------------
    |
    |  获取card
    |
    |-------------------------------------------------------------------------------
    */
    public function  card(){

        $user   = Auth::user('user');

        return Card::searchBy($this->card_sn);
    }



    /*
    |-------------------------------------------------------------------------------
    |
    | 表单格式验证错误
    |
    |-------------------------------------------------------------------------------
    */
    public function errorRespond(){

    	if(!$this->isValid()){
            $info               = $this->errors();
    		return $this->api->respondCommonError($info);
    	}
        //账号密码错误
        if(!$this->auth()){
            $info               = '登录后才可以使用';
            return $this->api->respondCommonError($info);
        }

        //礼品卡不存在
        if(!$this->giftCheck()){

            return $this->api->respondCommonError('礼品卡不存在');

        }

        //全部由礼品卡支付
        if($this->isAllCardPay()){

            return $this->api->respondCommonError('礼品卡金额大于订单总金额，禁止使用');
        }
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  为通过验证
    |
    |-------------------------------------------------------------------------------
    */
    public function allValid(){

        return ($this->isValid() && $this->auth() && $this->giftCheck() && (!$this->isAllCardPay())) ? true:false;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  保存成功 返回api信息
    |
    |-------------------------------------------------------------------------------
    */
    public function successRespond(){
        
    	$card           = $this->card();
        $tag 			= 'success';
    	$info 			= '成功使用礼品卡抵扣订单金额：￥'.$card->price;
        

    	return $this->api->respond(['data'=>compact('tag','info','card')]);
    }





    /*
    |-------------------------------------------------------------------------------
    |
    |  用户登录
    |
    |-------------------------------------------------------------------------------
    */
    public function persist(){
    	return true;
    }


}


    