<?php

namespace Phpstore\Repository;

use App\Models\Goods;
use Config;
use Storage;

trait GoodsGalleryRepository{

  
  /*
  |-------------------------------------------------------------------------------
  |
  | 使用trait 让模型GoodsGallery 拥有业务逻辑所需的方法
  |
  |-------------------------------------------------------------------------------
  */
  public function thumb(){

      return  ($this->thumb) ? Goods::icon($this->thumb) : '';
  }


  /*
  |-------------------------------------------------------------------------------
  |
  | 获取oss缩略图链接
  |
  |-------------------------------------------------------------------------------
  */
  public function getThumbOssAttribute(){

      return $this->thumb();
  }
  

  /*
  |-------------------------------------------------------------------------------
  |
  | 使用trait 让模型GoodsGallery 拥有业务逻辑所需的方法
  |
  |-------------------------------------------------------------------------------
  */
  public function img(){
      return  ($this->img) ? Goods::icon($this->img) : '';
  }


  /*
  |-------------------------------------------------------------------------------
  |
  | 使用trait 让模型GoodsGallery 拥有业务逻辑所需的方法
  |
  |-------------------------------------------------------------------------------
  */
  public function _original(){

      //返回相册的原图链接
      return  ($this->__original())? Goods::icon($this->__original()) : '';
  }






  /*
  |-------------------------------------------------------------------------------
  |
  | 删除相册所有图片
  |
  |-------------------------------------------------------------------------------
  */
  public function ImageDelete(){

      //删除数据
      $this->ImgDel($this->thumb);
      $this->ImgDel($this->img);
      $this->ImgDel($this->__original());
  }



  /*
  |-------------------------------------------------------------------------------
  |
  | 删除相册所有图片
  |
  |-------------------------------------------------------------------------------
  */
  public function ImgDel($img){

    if(empty($img)){

       return false;
    }

    //删除默认storage的图片
    (Storage::has($img)) ? Storage::delete($img) : '';
    //删除本地的图片
    (Storage::disk('local')->has($img)) ? Storage::disk('local')->delete($img) : '';
  }


  /*
  |-------------------------------------------------------------------------------
  |
  | 返回相册模型的字段
  |
  |-------------------------------------------------------------------------------
  */
  public function __original(){

      $row      = $this->toArray();
      //返回原始图片字段
      return  ($row['original']) ?  $row['original'] : false;
  }

  
}