<?php

namespace Phpstore\Repository;
use LaraStore\Presenters\TagPresenter;

trait TagRepository{

	/*
    |-------------------------------------------------------------------------------
    |
    | 标签添加的时间
    |
    |-------------------------------------------------------------------------------
    */
    public function time(){

    	return date('Y-m-d',$this->add_time);
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 返回商品名称
    |
    |-------------------------------------------------------------------------------
    */
    public function getGoodsNameAttribute(){
        return ($this->goods)? $this->goods->goods_name : '';
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 返回商品链接
    |
    |-------------------------------------------------------------------------------
    */
    public function getGoodsUrlAttribute(){
        return ($this->goods)? $this->goods->url() : '';
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 设置 presenter
    |
    |-------------------------------------------------------------------------------
    */
    public function presenter(){
    	return new TagPresenter($this);
    }

}