<?php

namespace LaraStore\Forms\Brand;

use Auth;
use App\User;
use App\Models\Brand;
use App\Http\Controllers\Api\ApiController as Api;
use LaraStore\Forms\Form;

class ShowForm extends Form{

	public $api;
	/*
    |-------------------------------------------------------------------------------
    |
    | 表单验证规则
    |
    |-------------------------------------------------------------------------------
    */
    protected $rules = [
        
    ];


    /*
    |-------------------------------------------------------------------------------
    |
    | 表单验证规则提示信息
    |
    |-------------------------------------------------------------------------------
    */
    protected $messages = [
       	
    ];


    /*
    |-------------------------------------------------------------------------------
    |
    | 构造函数
    |
    |-------------------------------------------------------------------------------
    */
    public function __construct(Api $api){
       $this->api           = $api;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  品牌模型是否为空
    |
    |-------------------------------------------------------------------------------
    */
    public function isEmpty(){

        return (empty(Brand::find($this->id)))? true :false;
    }

    

    /*
    |-------------------------------------------------------------------------------
    |
    |  成功后返回
    |
    |-------------------------------------------------------------------------------
    */
    public function successRespond(){

    	$tag 				= 'success';
    	$info 				= 'success';
        $model              = Brand::find($this->id);
        $goods_list         = $model->presenter()->goods_list();
    	return $this->api->respond(['data'=>compact('tag','info','goods_list')]);
    	
    }

    /*
    |-------------------------------------------------------------------------------
    |
    |  isValid
    |
    |-------------------------------------------------------------------------------
    */
    public function isValid(){

        return ($this->isEmpty())? false :true;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  验证未通过返回错误信息
    |
    |-------------------------------------------------------------------------------
    */
    public function errorRespond(){
        if($this->isEmpty()){
            $info       = '模型为空';
            return $this->api->respondCommonError($info);
        }
    }



    /*
    |-------------------------------------------------------------------------------
    |
    | 处理数据库相关操作
    |
    |-------------------------------------------------------------------------------
    */
    public function persist()
    {
         return true;
    }
}