<?php

namespace LaraStore\BatchOrder;
use App\Models\Goods;

class ArrayCommon{

	protected $collect;
	/*
    |-------------------------------------------------------------------------------
    |
    | 构造函数
    |
    |-------------------------------------------------------------------------------
    */
    public function __construct($collect){

    	$this->collect   =  $collect;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 设置参数
    |
    |-------------------------------------------------------------------------------
    */
    public function put($key,$value){

    	$this->$key  = $value;
    	return $this;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 转化数组形式
    |
    |-------------------------------------------------------------------------------
    */
    public function handle(){

    	return $this->make();
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 把订单放入关联数组中，key = order
    |
    |-------------------------------------------------------------------------------
    */
    public function make(){

    	$arr 		= [];
    	foreach($this->collect as $item){
    		$value  = $this->makeItem($item);
    		$arr[]	= ['order'=>$value];
    	}

    	return $arr;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 把订单放入关联数组中，key = goods  key = address
    |
    |-------------------------------------------------------------------------------
    */
    public function makeItem($data){

    	$length  						= count($data);
    	$arr 	 						= [];
    	foreach($data as $key=>$item){

    		//不是最后一条记录 即不是地址信息，是商品信息
    		if(($key+1) != $length){

    			$arr['goods'][] 		= $this->getGoodsInfo($item);
    		}
    	}
    	$arr['address']		= $this->getAddressInfo($data);

    	return $arr;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 获取地址信息
    |
    |-------------------------------------------------------------------------------
    */
    public function getAddressInfo($data){

    	 $length   = count($data);
    	 $arr 	   = $data[$length -1];
    	 return [
    	 			'username'	=>$arr[0],
    	 			'phone'		=>$arr[1],
    	 			'address'	=>$arr[2],
    	 ];
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 获取商品信息
    |
    |-------------------------------------------------------------------------------
    */
    public function getGoodsInfo($item){


    	$goods 			= Goods::searchByName($item[0]);
    	$attr 			= $item[1];
    	$number 		= empty($item[2])? 1: $item[2];
    	//把属性字符串拆分成属性数组
    	$attrs 			= explode("/", $attr);
        $arr 			= [];
        foreach($attrs as $value){

        	$arr[]		= [	
        					'goods_list'=>$goods,
        					'attr'		=>$value,
        					'number'	=>$number,
        	];
        }
        
        return $arr;
    }
    

    /*
    |-------------------------------------------------------------------------------
    |
    | 原始数组形式
    |
    |-------------------------------------------------------------------------------
    */
    public function arr1(){

        return  [   
    				[
    					['phpstore测试商品','400/200/100',1],
    					['宝马','200'],
    					['孙加','13810597838','北京北京北京'],
    				],
    				[
    				    ['美瞳1号','200/400/500',3],
    					['孙刚','12345678901','山东山东'],
    				],
    	];
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 转化后的数组形式
    |
    |-------------------------------------------------------------------------------
    */
    public function arr2(){

    	return  [
    				[   
    					'order'=>[
    										
    								'goods'=>[
    											[
    												[ 'name'=>'phpstore测试商品','attr'=>'400','number'=>1 ],
    												[ 'name'=>'phpstore测试商品','attr'=>'200','number'=>1 ],
    												[ 'name'=>'phpstore测试商品','attr'=>'100','number'=>1 ],
    											],
    											[
    												[ 'name'=>'宝马','attr'=>'200','number'=>1],
    											],
    								],
    								'address'=>['username'=>'孙加','phone'=>'13810597838','address'=>'北京北京北京'],
    					],
    				],
    				[	
    					'order'=>[
    						
    								'goods'=>[
    											[
    												[ 'name'=>'美瞳1号','attr'=>'200','number'=>3 ],
    												[ 'name'=>'美瞳1号','attr'=>'400','number'=>3 ],
    												[ 'name'=>'美瞳1号','attr'=>'500','number'=>3 ],
    											],
    								],
    								'address'=>['username'=>'孙刚','phone'=>'12345678901','address'=>'北京北京北京'],
    					],
    				],
    	];
 
    }

}