<?php

namespace LaraStore\Models;
use App\Models\Goods;

class PriceFormat{

  	protected $goods;
  	/*
  	|-------------------------------------------------------------------------------
  	|
  	|  构造函数
  	|
  	|-------------------------------------------------------------------------------
  	*/
  	public function __construct(Goods $goods){
  		$this->goods 	= $goods;
  	}



  	/*
  	|-------------------------------------------------------------------------------
  	|
  	|  格式化后的销售价格
  	|
  	|-------------------------------------------------------------------------------
  	*/
  	public function shop_price(){

  		return money_format("￥%i",$this->goods->shop_price);
  	}


  	/*
  	|-------------------------------------------------------------------------------
  	|
  	|  格式化后的市场价格
  	|
  	|-------------------------------------------------------------------------------
  	*/
  	public function market_price(){
  		return money_format("￥%i", $this->goods->market_price);
  	}


  	/*
  	|-------------------------------------------------------------------------------
  	|
  	|  格式化后的促销价格
  	|
  	|-------------------------------------------------------------------------------
  	*/
  	public function promote_price(){
  		return money_format("￥%i", $this->goods->promote_price);
  	}


  	/*
  	|-------------------------------------------------------------------------------
  	|
  	|  魔术方法 把方法的结果绑定到对象的属性
  	|
  	|-------------------------------------------------------------------------------
  	*/
  	public function __get($property){

  		return  (method_exists($this, $property))? call_user_func([$this,$property]) : false;
  	}


}