<?php

namespace LaraStore\Helpers\Category;
use App\Models\Category;
use DB;
use LaraStore\Helpers\Category\GoodsAttr;

class Attribute{

	protected $category;
	/*
    |-------------------------------------------------------------------------------
    |
    | 构造函数
    |
    |-------------------------------------------------------------------------------
    */
    public function __construct(Category $category){
    	$this->category 		= $category;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    | 返回结果
    |
    |-------------------------------------------------------------------------------
    */
    public function handle(){
    	return $this->toArray();
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  是否有子节点
    |
    |-------------------------------------------------------------------------------
    */
    public function hasChild(){
    	return (count($this->category->ids()) > 1)? true :false;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  基础查询
    |
    |-------------------------------------------------------------------------------
    */
    public function baseQuery(){
    	return DB::table('attribute as a')
    			 ->leftjoin('goods_attr as ga','ga.attr_id','=','a.id')
    			 ->leftjoin('goods as g','g.id','=','ga.goods_id');
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  拼接查询
    |
    |-------------------------------------------------------------------------------
    */
    public function catQuery(){

    	return ($this->hasChild())? $this->whereInQuery() : $this->whereQuery();
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  whereIn查询
    |
    |-------------------------------------------------------------------------------
    */
    public function whereInQuery(){
    	return $this->baseQuery()->whereIn('g.cat_id',$this->category->ids());
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  where查询
    |
    |-------------------------------------------------------------------------------
    */
    public function whereQuery(){
    	return $this->baseQuery()->where('g.cat_id',$this->category->id);
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  最终查询结果
    |
    |-------------------------------------------------------------------------------
    */
    public function query(){

    	return $this->catQuery()
    	            ->where('a.attr_type',0)
                    ->select('a.id','a.attr_name')
                    ->groupBy('a.id')
                    ->get();
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  获取分类下的属性列表
    |
    |-------------------------------------------------------------------------------
    */
    public function toArray(){

    	return (count($this->query()))? $this->fields() : [];
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  获取分类下的属性名称 +属性名称值列表
    |
    |-------------------------------------------------------------------------------
    */
    public function fields(){

    	$arr 		= [];
    	foreach($this->query() as $attr){
    		$arr[]				=[
    		    'id'			=>$attr->id,
    		    'attr_name'		=>$attr->attr_name,
    		    'attr_value'	=>$this->attr($this->getModel($attr))->handle(),
    		];
    	}

    	return $arr;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  获取模型
    |
    |-------------------------------------------------------------------------------
    */
    public function getModel($attr){
    	return \App\Models\Attribute::find($attr->id);
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  获取单个属性名称下面的商品属性值
    |
    |-------------------------------------------------------------------------------
    */
    public function attr($attr){
    	return new GoodsAttr($this->category,$attr);
    }


}