<?php

namespace LaraStore\Helpers\Category;
use App\Models\Category;
use DB;

class BrandList{

	protected $category;
	/*
    |-------------------------------------------------------------------------------
    |
    | 构造函数
    |
    |-------------------------------------------------------------------------------
    */
    public function __construct(Category $category){
    	$this->category 		= $category;
    }



    /*
    |-------------------------------------------------------------------------------
    |
    |  获取分类下的品牌列表函数
    |
    |-------------------------------------------------------------------------------
    */
    public function handle(){

    	return $this->query()->groupBy('b.id')->get();
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  基础查询
    |
    |-------------------------------------------------------------------------------
    */
    public function baseQuery(){

    	return  DB::table('brand as b')
    			  ->leftjoin('goods as g','g.brand_id','=','b.id')
    			  ->select('b.*');
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  是否有子类
    |
    |-------------------------------------------------------------------------------
    */
    public function hasChild(){

    	return (count($this->category->ids()) > 1)? true:false;
    }



    /*
    |-------------------------------------------------------------------------------
    |
    |  拼接查询
    |
    |-------------------------------------------------------------------------------
    */
    public function query(){

    	return ($this->hasChild())? $this->whereInQuery() : $this->whereQuery();
    }



    /*
    |-------------------------------------------------------------------------------
    |
    |  wherein查询
    |
    |-------------------------------------------------------------------------------
    */
    public function whereInQuery(){
    	return $this->baseQuery()->whereIn('g.cat_id',$this->category->ids());
    }



    /*
    |-------------------------------------------------------------------------------
    |
    |  where查询
    |
    |-------------------------------------------------------------------------------
    */
    public function whereQuery(){

    	return $this->baseQuery()->where('g.cat_id',$this->category->id);
    }


}