<?php

namespace LaraStore\Forms;

use App\Http\Controllers\Api\ApiController as Api;
use App\User;
use Auth;
use App\Models\Message;

class MessageDeleteForm extends Form{

	public $api;
	/*
    |-------------------------------------------------------------------------------
    |
    | 注册表单验证规则
    |
    |-------------------------------------------------------------------------------
    */
    protected $rules = [
        
    ];


    /*
    |-------------------------------------------------------------------------------
    |
    | 注册表单验证规则提示信息
    |
    |-------------------------------------------------------------------------------
    */
    protected $messages = [
       	
    ];


    /*
    |-------------------------------------------------------------------------------
    |
    | 构造函数
    |
    |-------------------------------------------------------------------------------
    */
    public function __construct(Api $api){
       $this->api       = $api;
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  验证用户是否登录
    |
    |-------------------------------------------------------------------------------
    */
    public function auth(){

    	return (Auth::check('user'))? true:false;
    }

    /*
    |-------------------------------------------------------------------------------
    |
    |  验证数据
    |
    |-------------------------------------------------------------------------------
    */
    public function isEmpty(){

        $model            =  Message::find($this->id);
        return empty($model)? true :false;
    }

    /*
    |-------------------------------------------------------------------------------
    |
    |  验证数据
    |
    |-------------------------------------------------------------------------------
    */
    public function isValid(){

        return ($this->auth() && (!$this->isEmpty())) ?  true : false;
    }




    /*
    |-------------------------------------------------------------------------------
    |
    |  成功后返回
    |
    |-------------------------------------------------------------------------------
    */
    public function successRespond(){

        $this->save();
    	$tag 		        = 'success';
    	$info 		        = 'success';
        $user               = Auth::user('user');
        $message_list       = $user->message()->get();
    	return $this->api->respond(['data'=>compact('tag','info','message_list')]);
    	
    }


    /*
    |-------------------------------------------------------------------------------
    |
    |  验证未通过返回错误信息
    |
    |-------------------------------------------------------------------------------
    */
    public function errorRespond(){

    	if(!$this->auth()){
            $info               = '用户未登录';
    		return $this->api->respondCommonError($info);
    	}

        if($this->isEmpty()){
            $info               = '模型不存在';
            return $this->api->respondCommonError($info);
        }
    	
    }



    /*
    |-------------------------------------------------------------------------------
    |
    | 存储注册表单中的数据到数据库
    |
    |-------------------------------------------------------------------------------
    */
    public function persist()
    {
         $model       = Message::find($this->id);
         $model->delete();
    }
}