/*
|-------------------------------------------------------------------------------
|
|  设置当前页效果
|
|-------------------------------------------------------------------------------
*/


var  crud 		= {};

$(function(){

	crud.nav('cat_id','category');
	crud.nav('brand_id','brand');
	crud.nav('article_id','article');
})


/*
|-------------------------------------------------------------------------------
|
|  添加自定义导航的时候 生成 商品分类 商品品牌 文章的链接
|
|-------------------------------------------------------------------------------
*/
crud.nav 	= function(dom,node){

	$(document).on('change','#'+dom,function(){

		var str  			= '';
		var base_url 		= $('#base_url').val();

		if($(this).val()){

			str 	=  node + '/' + $(this).val();
		}
		$('#nav_url').val(str);

	})
}



